# 4.6 Combining & Exporting Data

## This script contains the following ponits:
 
1. Create data to experiment on


2. Contacatenate dataframes


3. Append data


4. Merge data

In [26]:
# Import libraries

import pandas as pd
import numpy as np
import os

## 1. Create data to experiment on

In [27]:
# Define a dictionary containing January 2020 data

data1 = {'customer_id': ['6732', '767', '890', '635'],
        'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
        'purchased_meat': [0, 13, 3, 4],
        'purchased_alcohol':[1,2,10,0],
        'purchased_snacks': [10, 5, 1, 7]}

In [28]:
# Define a dictionary containing February 2020 data

data2= {'customer_id': ['6732', '767', '890', '635'],
       'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
       'purchased_meat': [0, 10, 5, 3],
       'purchased_alcohol': [2, 4, 14, 0],
       'purchased_snacks': [15, 3, 2, 6]}

In [29]:
# Convert the dictionary into dataframe

df = pd.DataFrame(data1, index = [0,1,2,3])
df_1 = pd.DataFrame(data2, index = [0,1,2,3])

In [30]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [31]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

## 2. Concatenate dataframes

In [32]:
# Create list-frames - containing the dataframes df and df_1

frames = [df, df_1]

In [33]:
# Check the output

frames

[  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Jan-20               0                  1                10
 1         767  Jan-20              13                  2                 5
 2         890  Jan-20               3                 10                 1
 3         635  Jan-20               4                  0                 7,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Feb-20               0                  2                15
 1         767  Feb-20              10                  4                 3
 2         890  Feb-20               5                 14                 2
 3         635  Feb-20               3                  0                 6]

In [34]:
# Check the data types to be sure it is a list

type (frames)

list

In [35]:
# Concatenate the dataframes with the pandas function pd.concat() in long -format

df_concat = pd.concat(frames)

In [36]:
# Check the output

df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [37]:
# Concatenate the dataframes in short- format using 'axis = 1'

df_concat = pd.concat (frames, axis = 1)

In [38]:
df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

## 3. Merging data

In [39]:
# Merge the dataframes df, df_1 using the common column 'customer_id'

df_merged = df.merge(df_1, on = 'customer_id')

In [40]:
df_merged

,customer_id,month_x,purchased_meat_x,purchased_alcohol_x,purchased_snacks_x,month_y,purchased_meat_y,purchased_alcohol_y,purchased_snacks_y
0,6732,Jan-20,0,1,10,Feb-20,0,2,15
1,767,Jan-20,13,2,5,Feb-20,10,4,3
2,890,Jan-20,3,10,1,Feb-20,5,14,2
3,635,Jan-20,4,0,7,Feb-20,3,0,6

In [41]:
# Merge the dataframes df and df_1  using multiples  common columns 'customer_id' and 'month'

df_merged = df.merge(df_1, on = ['customer_id', 'month'])

In [42]:
df_merged

Empty DataFrame
Columns: [customer_id, month, purchased_meat_x, purchased_alcohol_x, purchased_snacks_x, purchased_meat_y, purchased_alcohol_y, purchased_snacks_y]
Index: []

In [43]:
# Check for a full match via 'indicator = True'

df_merged = df.merge(df_1, on = ['customer_id', 'month'], indicator = True)

In [44]:
df_merged

Empty DataFrame
Columns: [customer_id, month, purchased_meat_x, purchased_alcohol_x, purchased_snacks_x, purchased_meat_y, purchased_alcohol_y, purchased_snacks_y, _merge]
Index: []

In [45]:
df_merged ['_merge'].value_counts()

left_only     0
right_only    0
both          0
Name: _merge, dtype: int64